blade_orig/0/U
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volVectorField;
 location "0";
 object U;
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (11.5 0 0);

boundaryField
{



  blade1
  {
    //type noSlip;
    type            movingWallVelocity; //From simpleRotor Tutorial
    uniformValue    (0 0 0);
value (0 0 0);
  }

  overset1
  {
    type            overset;
value (0 0 0);
  }

}

 	// ************************************************************************* //

