blade_orig/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      turb_energy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

/*internalField   uniform	0.24; //Motorbike*/
/*internalField   uniform 1.;*/
internalField   uniform 1.98;

boundaryField
{

    blade1
    {
		type	kqRWallFunction;
		value   $internalField;
    }
    overset1
    {
        type            overset;
value 0;
    }

}


// ************************************************************************* //
