blade_orig/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      dissip_rate;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 -1 0 0 0 0 ];

/*turbulentOmega       1.78;*///Motorbike
internalField   uniform 3.5;
/*internalField   uniform .5;*/

boundaryField
{
    blade1
    {
		type	zeroGradient;
		value	uniform	0;
    }

    overset1
    {
        type            overset;
value 0;
    }

}


// ************************************************************************* //
