blade_orig/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \      /  F ield         | cfMesh: A library for mesh generation          | 
|  \    /   O peration     |                                                |
|   \  /    A nd           | Author: Franjo Juretic                         | 
|    \/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
*---------------------------------------------------------------------------*/

FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "domain.stl";

maxCellSize 5;
//firstLayerThickness	0.004;

/*keepCellsIntersectingBoundary 	0;*/
/*checkForGluedMesh	1;*/
wakeLevel 0;
tipLevel 5;
foilLevel 5;
LELevel 6;
TELevel 6;
nVLayers 0;
tRatio 1.2;
scaling 2.0;
//minCellSize 0.2; // KEEP OFF ! OTHERWISE AUTOMATIC REFINEMENT AT WEDGE BOUNDARIES
boundaryLayers
{
		nLayers	0;
/*allowDiscontinuity	1;*/
    patchBoundaryLayers
    {
        "(foil|tip)"//blade defined as foil in freecad, extra/intrados in salome
        {
             nLayers	$nVLayers;
             thicknessRatio	$tRatio;
        }
    }
    optimiseLayer 1;
    optimisationParameters
    {
        nSmoothNormals 4;
        maxNumIterations 10;
        featureSizeFactor .4;
        reCalculateNormals 1;
        relThicknessTol .1;
    }
}
localRefinement
{
    foil//blade defined as foil in freecad, extra/intrados in salome
    {
        additionalRefinementLevels        $foilLevel;
    }
    tip
    {
	additionalRefinementLevels        $tipLevel;
    }
}
objectRefinements
{
    wake
    {
 additionalRefinementLevels        $wakeLevel;
        type box;
centre	(1.875 0 17.5);;
lengthX 3.75;
lengthY 1.5;
lengthZ 35.0;
    }
}
anisotropicSources
{
//    Plane//  Creates wedge issue
//    {
//        type plane;
//        origin (0 0 0);
//	normal (0 0 1);
//	scalingDistance 10000;
//        scalingFactor $scaling;
//    }
    Box
    {
        type box;
centre (10 0 20);
        lengthX 40;
        lengthY 20;
        lengthZ 40;
        scaleX 1;
        scaleY 1;
        scaleZ $scaling;
    }

}
surfaceMeshRefinement
{
    LE
    {
        surfaceFile        "LE.stl";
 additionalRefinementLevels        $LELevel;
    }
    TE
    {
        surfaceFile        "TE.stl";
 additionalRefinementLevels        $TELevel;
    }
}

// ************************************************************************* //
